In [7]:
import pandas as pd
import numpy as np

In [8]:
#Handling Missing Data.

In [9]:
import pandas as pd
str1=pd.Series(['Abc','def','shg',np.nan,'ajk'])
str1

0    Abc
1    def
2    shg
3    NaN
4    ajk
dtype: object

In [10]:
str1.isnull()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [11]:
from numpy import nan as NA
data=pd.Series([1,2,3,NA,4,NA])

In [12]:
data.dropna()

0    1.0
1    2.0
2    3.0
4    4.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
1    2.0
2    3.0
4    4.0
dtype: float64

In [14]:
data2=pd.DataFrame([[1,2,4],[23,NA,2],[5,6,3],[2,4,NA],[NA,NA,NA]])

In [15]:
data2

      0    1    2
0   1.0  2.0  4.0
1  23.0  NaN  2.0
2   5.0  6.0  3.0
3   2.0  4.0  NaN
4   NaN  NaN  NaN

In [16]:
data2.dropna() #remove all the rows or columns with NA

     0    1    2
0  1.0  2.0  4.0
2  5.0  6.0  3.0

In [17]:
data2.dropna(how='all') #removing a row with NA

      0    1    2
0   1.0  2.0  4.0
1  23.0  NaN  2.0
2   5.0  6.0  3.0
3   2.0  4.0  NaN

In [18]:
data2[3]=NA

In [19]:
data2

      0    1    2   3
0   1.0  2.0  4.0 NaN
1  23.0  NaN  2.0 NaN
2   5.0  6.0  3.0 NaN
3   2.0  4.0  NaN NaN
4   NaN  NaN  NaN NaN

In [37]:
data2.dropna(axis=1,how='all') #axis=1 remove column with NA

      0    1    2
0   1.0  2.0  4.0
1  23.0  NaN  2.0
2   5.0  6.0  3.0
3   2.0  4.0  NaN
4   NaN  NaN  NaN

In [38]:
data2.dropna(axis=0,how='all') #axis=0 remove row with NA

      0    1    2   3
0   1.0  2.0  4.0 NaN
1  23.0  NaN  2.0 NaN
2   5.0  6.0  3.0 NaN
3   2.0  4.0  NaN NaN

In [39]:
df=pd.DataFrame(np.random.randn(6,3))

In [40]:
df

          0         1         2
0 -1.630963 -1.456301  1.100091
1  0.363929  1.673294  0.107879
2 -1.738990 -0.827817  0.427907
3  0.068887  1.090925  1.127046
4 -0.542810 -0.668187  1.418266
5  0.445568 -0.423154  1.048759

In [41]:
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0 -1.630963       NaN       NaN
1  0.363929       NaN       NaN
2 -1.738990       NaN  0.427907
3  0.068887       NaN  1.127046
4 -0.542810 -0.668187  1.418266
5  0.445568 -0.423154  1.048759

In [42]:
df.dropna()

          0         1         2
4 -0.542810 -0.668187  1.418266
5  0.445568 -0.423154  1.048759

In [43]:
df

          0         1         2
0 -1.630963       NaN       NaN
1  0.363929       NaN       NaN
2 -1.738990       NaN  0.427907
3  0.068887       NaN  1.127046
4 -0.542810 -0.668187  1.418266
5  0.445568 -0.423154  1.048759

In [48]:
df.dropna(thresh=2)

          0         1         2
2 -1.738990       NaN  0.427907
3  0.068887       NaN  1.127046
4 -0.542810 -0.668187  1.418266
5  0.445568 -0.423154  1.048759

In [49]:
#Filling In Missing Data

In [51]:
df.fillna(0)

          0         1         2
0 -1.630963  0.000000  0.000000
1  0.363929  0.000000  0.000000
2 -1.738990  0.000000  0.427907
3  0.068887  0.000000  1.127046
4 -0.542810 -0.668187  1.418266
5  0.445568 -0.423154  1.048759

In [55]:
df.fillna({0:1,1:0.7,2:0})

          0         1         2
0 -1.630963  0.700000  0.000000
1  0.363929  0.700000  0.000000
2 -1.738990  0.700000  0.427907
3  0.068887  0.700000  1.127046
4 -0.542810 -0.668187  1.418266
5  0.445568 -0.423154  1.048759

In [56]:
df.fillna(0,inplace=True)

In [57]:
df

          0         1         2
0 -1.630963  0.000000  0.000000
1  0.363929  0.000000  0.000000
2 -1.738990  0.000000  0.427907
3  0.068887  0.000000  1.127046
4 -0.542810 -0.668187  1.418266
5  0.445568 -0.423154  1.048759

In [63]:
data=pd.DataFrame(np.random.randn(5,4))
data

          0         1         2         3
0 -2.037628  0.402441 -1.837296 -1.147804
1 -2.088472 -0.087167 -0.457666  0.461634
2 -1.258276 -1.419271  0.839895  1.305446
3  0.033706 -0.638742  0.834079 -0.668245
4 -0.515408 -0.082940  1.908013  0.876176

In [65]:
data.iloc[2:,1]=NA
data.iloc[4:,1]=NA
data

          0         1         2         3
0 -2.037628  0.402441 -1.837296 -1.147804
1 -2.088472 -0.087167 -0.457666  0.461634
2 -1.258276       NaN  0.839895  1.305446
3  0.033706       NaN  0.834079 -0.668245
4 -0.515408       NaN       NaN  0.876176

In [66]:
data.fillna(method='ffill',limit=2)

          0         1         2         3
0 -2.037628  0.402441 -1.837296 -1.147804
1 -2.088472 -0.087167 -0.457666  0.461634
2 -1.258276 -0.087167  0.839895  1.305446
3  0.033706 -0.087167  0.834079 -0.668245
4 -0.515408       NaN  0.834079  0.876176

In [69]:
data.fillna(method='ffill',limit=3)

          0         1         2         3
0 -2.037628  0.402441 -1.837296 -1.147804
1 -2.088472 -0.087167 -0.457666  0.461634
2 -1.258276 -0.087167  0.839895  1.305446
3  0.033706 -0.087167  0.834079 -0.668245
4 -0.515408 -0.087167  0.834079  0.876176

In [70]:
data2=pd.Series([2.,NA,3.9,NA,6])
data2.fillna(data2.mean())

0    2.000000
1    3.966667
2    3.900000
3    3.966667
4    6.000000
dtype: float64

In [71]:
data2.fillna(data.median())

0    2.000000
1    0.157637
2    3.900000
3    0.461634
4    6.000000
dtype: float64

In [73]:
data2.fillna(data2.mode())

0    2.0
1    3.9
2    3.9
3    NaN
4    6.0
dtype: float64

In [75]:
data=pd.DataFrame({'c1':['a','b']*3+['b'],
                  'c2':[1,2,3,2,2,3,1]})

In [76]:
data

  c1  c2
0  a   1
1  b   2
2  a   3
3  b   2
4  a   2
5  b   3
6  b   1

In [77]:
data.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
dtype: bool

In [79]:
data.drop_duplicates()

  c1  c2
0  a   1
1  b   2
2  a   3
4  a   2
5  b   3
6  b   1

In [84]:

data['c3']=range(7)
data.drop_duplicates(['c1'])

  c1  c2  c3
0  a   1   0
1  b   2   1

In [85]:
data.drop_duplicates(['c1','c2'],keep='last')

  c1  c2  c3
0  a   1   0
2  a   3   2
3  b   2   3
4  a   2   4
5  b   3   5
6  b   1   6

In [86]:
data.drop_duplicates(['c1','c2'],keep='first')

  c1  c2  c3
0  a   1   0
1  b   2   1
2  a   3   2
4  a   2   4
5  b   3   5
6  b   1   6

In [90]:
dff=pd.Series([1. ,2.222,-2.222,-362.,23.,2.222,76.])
dff

0      1.000
1      2.222
2     -2.222
3   -362.000
4     23.000
5      2.222
6     76.000
dtype: float64

In [91]:
dff.replace(2.222,np.nan)

0      1.000
1        NaN
2     -2.222
3   -362.000
4     23.000
5        NaN
6     76.000
dtype: float64

In [97]:
dff.replace({2.222: np.nan,76.:0.})

0      1.000
1        NaN
2     -2.222
3   -362.000
4     23.000
5        NaN
6      0.000
dtype: float64